#-*-coding: utf-8-*-
#######################sublime text 2용 hotkey##############
#ctrl + / => block comment hotkey
#shift + tab or tab => indent hotkey

########################import py field####################
import time
import threading
from msvcrt import getch
########################import field#######################

########################global value#######################
import FLAG as F #여기에서 받아서, ACITION 취하고 나중에 FLAG 다시 내려주고
import Global as G #flag 뜨고 Global에 작업해주면 되는 것임
###########################################################

# https://stackoverflow.com/questions/7079864/real-time-operating-via-python/24819846


###########################################################
###########################################################
#ACTION관련을 모두 정의하려고 넣은 것임
## SIMULATOR






###########################################################
###########################################################
#ACTION관련을 모두 정의하려고 넣은 것임
## TASK MANAGER







###########################################################
###########################################################
#ACTION관련을 모두 정의하려고 넣은 것임
## STATE WRAPPER






###########################################################
###########################################################
#ACTION관련을 모두 정의하려고 넣은 것임
## WORKER, ORDER, GAUSSIAN, MACHINE






###########################################################
###########################################################
#ACTION관련을 모두 정의하려고 넣은 것임
## SIMULATOR






###########################################################
###########################################################

